InformationRegisters/бит_ЗначениеСвойствОбъектовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗначениеСвойствОбъектовУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_СвойстваОбъектовУчета</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_СвойстваОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ГраницыЗапретаИзмененияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГраницыЗапретаИзмененияДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfAccounts/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<ChartOfAccounts>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

CommonModules/бит_РаботаСДиалогамиСервер/Ext/Module.bsl
#Область ОбщиеДействияВУправляемыхФормах

Процедура ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, ТекущийОбъект, СтрПар = Неопределено) Экспорт
	
	ПолноеИмяОбъекта = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	Имена = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ПолноеИмяОбъекта);
	
	Если ЗначениеЗаполнено(Имена.ИмяКоллекции)  Тогда
		
		ИмяТипаОбъект = Имена.ИмяКласса+"Объект."+Имена.ИмяОбъекта;				
		ТипОбъект = Тип(ИмяТипаОбъект);
		
		Об = ДанныеФормыВЗначение(ТекущийОбъект, ТипОбъект);
		
	КонецЕсли; 
	
КонецПроцедуры // ФормаОбъектаПриСозданииНаСервере()

Процедура ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ТекущаяФорма, ТекущийОбъект, СтрПар = Неопределено) Экспорт
	
	ПолноеИмяОбъекта = бит_ОбщегоНазначения.ПолучитьИмяОбъектаПоИмениФормы(ТекущаяФорма.ИмяФормы, Истина);
	Имена            = бит_ОбщегоНазначенияКлиентСервер.РазобратьПолноеИмяОбъекта(ПолноеИмяОбъекта);
	
	Если ЗначениеЗаполнено(Имена.ИмяКоллекции)  Тогда
		
		ИмяТипаОбъект = Имена.ИмяКласса + "Объект." + Имена.ИмяОбъекта;				
		ТипОбъект     = Тип(ИмяТипаОбъект);
		
		Об = ДанныеФормыВЗначение(ТекущийОбъект, ТипОбъект);
		
	КонецЕсли; 
	
КонецПроцедуры // ФормаОбъектаПриСозданииНаСервере()

// Функция получает описание значений свойств.
//
// Параметры:
//  ДокументОбъект - ссылка на объект, для которого необходимо получить описание.
//
Функция ПолучитьОписаниеЗначенийСвойствОбъекта(Ссылка) Экспорт 
	
	ОписаниеЗначенийСвойств = "Дополнительные реквизиты";
	
	Если Ссылка = Неопределено Тогда
		Возврат ОписаниеЗначенийСвойств;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.ВидСвойства,
	|	ВЫБОР
	|		КОГДА ЗначенияСвойствОбъектов.Значение = ИСТИНА
	|			ТОГДА ""Да""
	|		КОГДА ЗначенияСвойствОбъектов.Значение = ЛОЖЬ
	|			ТОГДА ""Нет""
	|		ИНАЧЕ ЗначенияСвойствОбъектов.Значение
	|	КОНЕЦ КАК Значение
	|ИЗ
	|	РегистрСведений.бит_ЗначениеСвойствОбъектовУчета КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.ОбъектУчета = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗначенияСвойствОбъектов.ВидСвойства.Наименование";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ОписаниеЗначенийСвойств = "";
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.Значение) = Тип("Дата") Тогда
				Если Выборка.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Дата Тогда
					ОписаниеЗначенийСвойств = ОписаниеЗначенийСвойств + Выборка.Свойство + ": " + Формат(Выборка.Значение, "ДФ=dd.MM.yyyy") + Символы.ПС;
				ИначеЕсли Выборка.Свойство.ТипЗначения.КвалификаторыДаты.ЧастиДаты = ЧастиДаты.Время Тогда
					ОписаниеЗначенийСвойств = ОписаниеЗначенийСвойств + Выборка.Свойство + ": " + Формат(Выборка.Значение, "ДФ=ЧЧ:мм:сс") + Символы.ПС;
				Иначе
					ОписаниеЗначенийСвойств = ОписаниеЗначенийСвойств + Выборка.Свойство + ": " + Выборка.Значение + Символы.ПС;
				КонецЕсли;
			Иначе
				ОписаниеЗначенийСвойств = ОписаниеЗначенийСвойств + Выборка.Свойство + ": " + Выборка.Значение + Символы.ПС;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ОписаниеЗначенийСвойств;
	
КонецФункции

Функция ДатаКакМесяцПредставление(ДатаДата) Экспорт
	
	Возврат Формат(ДатаДата, "ДФ='ММММ гггг'");
	
КонецФункции

//  Процедура определяет ситуацию, когда при изменении своей даты документ. 
//  Оказывается в другом периоде нумерации документов, и в это м случае.
//  Присваивает документу новый уникальный номер.
//
// Параметры:
//  ДокументОбъект         - контекст документа,из которого вызвана процедура. 
//  НачальнаяДатаДокумента - начальная дата документа. 
// 
Процедура ПроверитьНомерДокумента(ДокументОбъект, НачальнаяДатаДокумента) Экспорт   // В разработке.
	
	// Определяем назначенную для данного вида документов периодичность смены номера.
	ПериодСменыНомера = ДокументОбъект.Метаданные().ПериодичностьНомера;
	
	// В зависимости от установленной периодичности смены номеров,.
	// Определяем разность старой и новой датами документа.
	Если ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Год Тогда
		РазностьДат = НачалоГода(НачальнаяДатаДокумента) - НачалоГода(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Квартал Тогда
		РазностьДат = НачалоКвартала(НачальнаяДатаДокумента) - НачалоКвартала(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.Месяц Тогда
		РазностьДат = НачалоМесяца(НачальнаяДатаДокумента) - НачалоМесяца(ДокументОбъект.Дата);
		
	ИначеЕсли ПериодСменыНомера = Метаданные.СвойстваОбъектов.ПериодичностьНомераДокумента.День Тогда
		РазностьДат = НачалоДня(НачальнаяДатаДокумента) - НачалоДня(ДокументОбъект.Дата);
		
	Иначе
		Возврат;
		
	КонецЕсли;
	
	Если РазностьДат <> 0 Тогда
		ДокументОбъект.Номер = "";
	КонецЕсли;
	
КонецПроцедуры // ПроверитьНомерДокумента()

// Активизирует один из реквизитов при открытии документа.
//
// Параметры:
//  ДокументОбъект     - объект документа,. 
//  ФормаДокумента     - форма документа.
//  СтруктураРеквизитов- заранее определенные реквизиты для проверки .
//  ТабличнаяЧасть     - имя ТЧ на которую будет установлен фокус если все обяз. реквизиты заполнены.
//  СтраницыСТабЧастями- структура типа ("имя страницы",	"имя таблицы размещенной на этой странице"), т.е.
//     В параметр "ТабличнаяЧасть" можно передать имя страницы.
//     На которой размещена ТЧ, а структура "СтраницыСТабЧастями".
//     Необходима для поиска ТЧ по имени страницы.
Функция АктивизироватьРеквизитВФорме(ДокументОбъект, ФормаДокумента, СтруктураРеквизитов = Неопределено, ТабличнаяЧасть = Неопределено, СтраницыСТабЧастями = Неопределено) Экспорт
	
	Если Не ДокументОбъект.Проведен Тогда
		
		Если СтруктураРеквизитов = Неопределено Тогда
			
			// Структура - порядок активизации реквизитов.
			// Активизируется первый не заполненный.
			СтруктураРеквизитов = Новый Структура();
			
			СтруктураРеквизитов.Вставить("Дата");
			СтруктураРеквизитов.Вставить("Организация");      
			СтруктураРеквизитов.Вставить("СчетОрганизации");
			СтруктураРеквизитов.Вставить("Склад");
			СтруктураРеквизитов.Вставить("БанковскийСчет");
			СтруктураРеквизитов.Вставить("ФизЛицо");
			СтруктураРеквизитов.Вставить("Контрагент");
			СтруктураРеквизитов.Вставить("ДоговорКонтрагента");
			СтруктураРеквизитов.Вставить("Касса");
			СтруктураРеквизитов.Вставить("Получатель");
			СтруктураРеквизитов.Вставить("Плательщик");
			СтруктураРеквизитов.Вставить("ПодразделениеОрганизации");
			
		КонецЕсли;
		
		Для каждого Элемент Из СтруктураРеквизитов Цикл
			
			// Определим, есть ли ЭУ с таким именем.
			ЭлементУправления = ФормаДокумента.Элементы.Найти(Элемент.Ключ);
			
			Если ЭлементУправления <> Неопределено Тогда // есть такой
				
				Если ЭлементУправления.Видимость И ЭлементУправления.Доступность И НЕ ЗначениеЗаполнено(Элемент.Значение) Тогда 
					
					// Нашли не заполненный ЭУ. Делаем его текущим и прекращаем цикл.
					ФормаДокумента.ТекущийЭлемент = ЭлементУправления;
					
					Возврат(Истина);
					
					Прервать;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Если в документе есть ТЧ то необходимой фокус передать ей.
	Если ТабличнаяЧасть <> Неопределено Тогда
		
		ЭлементУправления = ФормаДокумента.Элементы.Найти(ТабличнаяЧасть.Имя);
		
		Если ТипЗнч(ЭлементУправления) = Тип("ТабличноеПоле") Тогда
			
			ФормаДокумента.ТекущийЭлемент = ЭлементУправления;
			
			Возврат(Истина);
			
		ИначеЕсли СтраницыСТабЧастями <> неопределено Тогда
			
			ЭлементУправления = ФормаДокумента.Элементы.Найти(СтраницыСТабЧастями.НайтиПоЗначению(ТабличнаяЧасть.Имя));
			
			Если ТипЗнч(ЭлементУправления) = Тип("ТабличноеПоле") Тогда
				
				ФормаДокумента.ТекущийЭлемент = ЭлементУправления;
				
				Возврат(Истина);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если все поля заполнены но нет ТЧ то передадим фокус панели, в результате.
	// Визуально будет казаться что фокус не установлен ни на одном ЭФ.
	// Хотелось бы фокус установить на кнопке "Закрыть", но пока технически не предоставляется.
	// Такой возможности.
	ЭлементУправления = ФормаДокумента.Элементы.Найти("ОсновныеДействияФормы");
	
	Если ЭлементУправления <> Неопределено Тогда
		
		ФормаДокумента.ТекущийЭлемент = ЭлементУправления;
		
		Возврат(Истина);
		
	КонецЕсли;
	
	Возврат(Ложь);
	
КонецФункции// АктивизироватьРеквизитВФорме()

// Заполняет в соответствие с переданными ограничениями список счетов учета денежных средств,.
// Из которых будет производиться выбор пользователем в форме документа.
//
// Параметры:
//  МассивСчетовОтбора		 		– <Массив> – массив счетов-групп. В результат функции попадут субсчета этих счетов. 
//  МассивСчетовИсключений		 		– <Массив> – массив счетов, которые будут исключены из отбора. 
//  ОтборПоПризнакуВалютный	 		– <Булево> – нужен ли дополнительный отбор.
//  Среди выбранных счетов по признаку "Валютный". 
//  СчетОтбораПоПризнакуВалютный 	– <ПланыСчетов.Хозрасчетный> – счет, в соответствие в признаком "Валютный" которого.
//                              	будет ограничиваться список - результат функции.
//
// Возвращаемое значение:
//   <СписокЗначений> – список счетов, среди которых будет производиться выбор в форме документа.
//
Функция ЗаполнитьСписокВыбораСчетовДенежныхСредств(МассивСчетовОтбора, ОтборПоПризнакуВалютный = Ложь, СчетОтбораПоПризнакуВалютный = Неопределено,МассивСчетовИсключений = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСчетовОтбора", МассивСчетовОтбора);
	Запрос.УстановитьПараметр("МассивСчетовИсключений", МассивСчетовИсключений);
	
	Запрос.УстановитьПараметр("ОтбиратьПоПризнакуВалютный", ОтборПоПризнакуВалютный);
	
	Если ТипЗнч(СчетОтбораПоПризнакуВалютный) = Тип("ПланСчетовСсылка.Хозрасчетный") Тогда
		Запрос.УстановитьПараметр("Валютный", СчетОтбораПоПризнакуВалютный.Валютный);
	Иначе
		Запрос.УстановитьПараметр("Валютный", Ложь);
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка КАК Счет,
	|	Хозрасчетный.Код КАК Код,
	|	Хозрасчетный.Наименование КАК Наименование
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Ссылка В ИЕРАРХИИ(&МассивСчетовОтбора)
	|	И НЕ Хозрасчетный.ЗапретитьИспользоватьВПроводках
	|	И (НЕ &ОтбиратьПоПризнакуВалютный
	|			ИЛИ Хозрасчетный.Валютный = &Валютный)
	|	И НЕ Хозрасчетный.Ссылка В (&МассивСчетовИсключений)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	СписокВыбора = Новый СписокЗначений;
	
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		СписокВыбора.Добавить(Результат.Счет, Результат.Код + " (" + Результат.Наименование + ")");
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции // ЗаполнитьСписокВыбораСчетовДенежныхСредств()

// Процедура устанавливает свойство формы ТолькоПросмотр в зависимости.
// От возможности редактирования документа в связи с  установкой даты запрета редактирования.
//
Процедура УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ФормаДокумента) Экспорт
	
	Попытка
		
		НаборЗаписей = РегистрыСведений.бит_ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		
		НаборЗаписей.Прочитать();
		
		СоответствиеГраницЗапрета = Новый Соответствие;
		Для каждого строка из НаборЗаписей Цикл
			
			СоответствиеГраницЗапрета.Вставить(строка.Организация,строка.ГраницаЗапретаИзменений);
			
		КонецЦикла;	
		
	Исключение
		
		СоответствиеГраницЗапрета = Неопределено
		
	КонецПопытки;
	
	// Для пользователя с полными правами проверок выполнять не нужно.
	Если СоответствиеГраницЗапрета = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроверкиДокумента = бит_НастройкаПравДоступа.ПолучитьПараметрыПроверкиДокумента(ДокументОбъект);
	
	бит_НастройкаПравДоступа.ПроверитьВерсиюДокумента(ДокументОбъект, ПараметрыПроверкиДокумента, СоответствиеГраницЗапрета, ФормаДокумента.ТолькоПросмотр);
	
КонецПроцедуры	// УстановитьДоступностьФормыДляРедактирования

#КонецОбласти
